Show / Hide Table of Contents
Class ResultOfLoading
Result Of Loading
Inheritance
System.Object
Loading
ResultOfLoading
Inherited Members
 Loading.LoadingType
 Loading.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class ResultOfLoading : Loading
Constructors
Improve this Doc   View Source
ResultOfLoading()
Constructor
Declaration
public ResultOfLoading()
Properties
Improve this Doc   View Source
Items
Items od loading
Declaration
public List<ResultOfLoadingItem> Items { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ResultOfLoadingItem>
 Improve this Doc
 View Source